Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: སོ་སོ་ཡང་དག་པར་རིག་པ་མི་ཟད་པ་ཉིད་དང་། ཡེ་ཤེས་མི་ཟད་པ་ཉིད་དང་། ཤེས་རབ་མི་ཟད་པ་ཉིད་དང་། གཟུངས་ཀྱི་སྤོབས་པ་མི་ཟད་པ་ཉིད་དེ། བཞི་པོ་དེ་དག་གོ།
en: The four are inexhaustibility of correct understanding, inexhaustibility of wisdom, inexhaustibility of insight, and inexhaustibility of eloquence in dhāraṇī.

source: །ཀླུའི་བདག་པོ་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ནི་གཏིང་དཔག་དཀའ་བ་བཞིས་རྟོགས་པར་བྱ་སྟེ།
en: “Nāga Lord, the inexhaustible casket dhāraṇī should be realized through four unfathomables.

source: བསམ་པ་གཏིང་དཔག་དཀའ་བ་དང་། བློ་གཏིང་དཔག་དཀའ་བ་དང་། ཆོས་ལ་འཇུག་པ་གཏིང་དཔག་དཀའ་བ་དང་། སེམས་ཅན་གྱི་སྤྱོད་པ་ལ་འཇུག་པ་གཏིང་དཔག་དཀའ་བ་སྟེ། བཞི་པོ་དེ་དག་གོ།
en: The four are unfathomable contemplation, unfathomable mind, unfathomable engagement with phenomena, and unfathomable understanding of beings’ conduct.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་སྙིང་པོ་དང་། ཡི་གེ་ཡིན་པར་རྟོགས་པར་བྱ་སྟེ།
en: “Nāga Lord, the following four things should be understood as the essence and the word of the inexhaustible casket dhāraṇī.

source: ཤེས་རབ་ལ་སྙིང་པོར་བྱེད་པ་དང་། སྒྲུབ་པ་ལ་སྙིང་པོར་བྱེད་པ་དང་། བཟོད་པ་ལ་གནས་པ་སྙིང་པོར་བྱེད་པ་དང་། བརྩམས་པ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པ་སྙིང་པོར་བྱེད་པ་སྟེ། བཞི་པོ་དེ་དག་གོ།
en: They are treating insight as essential, taking practice to heart, taking the practice of patience to heart, and taking mastery of one’s endeavors to heart.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་ངེས་པར་འབྱེད་པ་སྟེ།
en: “Nāga Lord, four factors penetrate the inexhaustible casket dhāraṇī.

source: བདེན་པ་ངེས་པར་འབྱེད་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ངེས་པར་འབྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ངེས་པར་འབྱེད་པ་དང་། ཐེག་པ་ཐམས་ཅད་ངེས་པར་འབྱེད་པ་སྟེ། བཞི་པོ་དེ་དག་གོ།
en: They are discerning the truths, discerning dependent origination, discerning the conduct of all beings, and discerning all the vehicles.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་སྣང་བ་ཡིན་ཏེ།
en: “Nāga Lord, four factors are the light of the inexhaustible casket dhāraṇī.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྣང་བ་དང་། ཤེས་རབ་ཀྱི་སྣང་བ་དང་། ཤེས་རབ་ཀྱི་མིག་གི་སྣང་བ་དང་། སོ་སོ་ཅི་རིགས་པར་ཆོས་སྟོན་པའི་སྣང་བ་སྟེ། བཞི་པོ་དེ་དག་གོ།
en: They are the light of all beings, the light of insight, the light of the eye of wisdom, and the light of teaching the Dharma as suited to individuals.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་རྟུན་པ་ཡིན་ཏེ།
en: “Nāga Lord, four factors are the effort of the inexhaustible casket dhāraṇī.

source: བརྩོན་འགྲུས་རྟུན་པ་དང་། ཚུལ་ཁྲིམས་རྟུན་པ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་ཡོངས་སུ་ཚོལ་བ་རྟུན་པ་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་ཚོལ་བ་རྟུན་པ་སྟེ།
en: They are the effort of diligence, the effort of discipline, the effort of seeking the accumulation of merit, and the effort of seeking the accumulation of wisdom.

source: བཞི་པོ་དེ་དག་གོ། །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་ཆོས་ཡོངས་སུ་ཚོལ་བ་མཐར་ཐུག་པ་མེད་པ་སྟེ།
en: “Nāga Lord, four factors show how there is no end to pursuing the Dharma of the inexhaustible casket dhāraṇī.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་ཚོལ་བ་མཐར་ཕྱིན་པ་མེད་པ་དང་། འཁོར་བས་ཡོངས་སུ་མི་སྐྱོ་བ་ཡོངས་སུ་ཚོལ་བ་མཐར་ཕྱིན་པ་མེད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ཡོངས་སུ་ཚོལ་བ་མཐར་ཕྱིན་པ་མེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་ཚོལ་བ་མཐར་ཕྱིན་པ་མེད་པ་སྟེ། བཞི་པོ་དེ་དག་གོ།
en: There is no limit to the pursuit of the perfections, no limit to the pursuit of not being discouraged by saṃsāra, no limit to the pursuit of ripening beings, and no limit to the pursuit of omniscient wisdom.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ལ་ཆོག་མི་ཤེས་པ་སྟེ།
en: “Nāga Lord, there are four ways to be insatiable regarding the inexhaustible casket dhāraṇī.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལས་མངོན་སུམ་དུ་ཆོས་མཉན་པས་ཆོག་མི་ཤེས་པ་དང་། སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་པས་ཆོག་མི་ཤེས་པ་དང་། དགེ་བའི་རྩ་བ་ཡོངས་སུ་ཚོལ་བས་ཆོག་མི་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། བཀུར་སྟི་བྱ་བས་ཆོག་མི་ཤེས་པ་སྟེ། བཞི་པོ་དེ་དག་གོ།
en: They are being insatiable about learning the Dharma directly from blessed buddhas, being insatiable about teaching the Dharma to beings, being insatiable in pursuing roots of virtue, and being insatiable in venerating and honoring the thus-gone ones.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ལ་ཚུགས་པར་དཀའ་བ་ཡིན་ཏེ།
en: “Nāga Lord, there are four ways in which the inexhaustible casket dhāraṇī is invulnerable.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་ཚུགས་པར་དཀའ་བ་དང་། བདུད་ཐམས་ཅད་ཀྱིས་ཚུགས་པར་དཀའ་བ་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་ཚུགས་པར་དཀའ་བ་དང་། གཞན་གྱིས་བྱས་པ་ཐམས་ཅད་ཀྱིས་ཚུགས་པར་དཀའ་བ་སྟེ། བཞི་པོ་དེ་དག་གོ།
en: It is invulnerable to any afflictions, it is invulnerable to any māras, it is invulnerable to any opposing forces, and it is invulnerable to the deeds of others.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་མ་འདྲེས་པ་སྟེ།
en: “Nāga Lord, there are four ways in which the inexhaustible casket dhāraṇī is unadulterated.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་དང་མ་འདྲེས་པ་དང་། རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ཐམས་ཅད་ཀྱིས་མ་འདྲེས་པ་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་དང་མ་འདྲེས་པ་དང་། སོ་སོའི་སྐྱེ་བོའི་ཉེས་པ་ཐམས་ཅད་དང་མ་འདྲེས་པ་སྟེ།
en: It is unadulterated by the hearers and solitary buddhas; it is unadulterated by all forms of gain, honor, and praise; it is unadulterated by the fetters of habitual tendency; and it is unadulterated by any of the faults of ordinary beings.

source: བཞི་པོ་དེ་དག་ནི་མ་འདྲེས་པ་ཡིན་ནོ།
en: It is unadulterated in these four ways.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ལ་སྨད་དུ་མེད་པ་སྟེ།
en: “Nāga Lord, there are four ways in which the inexhaustible casket dhāraṇī cannot be slandered.

source: སྐྱེ་བ་སྨད་དུ་མེད་པ་དང་། ཚུལ་ཁྲིམས་འཆལ་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་སྨད་དུ་མེད་པ་དང་། ཆོས་བསྟན་པའི་བྲེ་མོ་གཏམ་གཅིག་པུ་ལ་སྨད་དུ་མེད་པ་དང་། ཐེག་པ་ཆེན་པོས་སྒྲོལ་བའི་ཕྱིར་སློང་བ་པོ་སྨད་དུ་མེད་པ་སྟེ།
en: One’s birth cannot be slandered, its ability to ripen beings with lapsed ethical discipline is irreproachable, it cannot be criticized for being only prattle derived from Dharma teaching, and those who request it to liberate others through the Great Vehicle cannot be criticized.

source: བཞི་པོ་དེ་དག་ནི་སྨད་དུ་མེད་པ་ཡིན་ནོ།
en: These are the four respects in which it cannot be slandered.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་སྟོབས་ཡིན་ཏེ།
en: “Nāga Lord, there are four strengths of the inexhaustible casket dhāraṇī.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེས་པ་བྱས་པ་བཟོད་པའི་ཕྱིར་བཟོད་པའི་སྟོབས་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སོམ་ཉི་གཅོད་པའི་ཕྱིར་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་ཡོངས་སུ་ཤེས་པའི་ཕྱིར་མངོན་པར་ཤེས་པའི་སྟོབས་དང་། སོ་སོ་ཅི་རིགས་པར་ཆོས་སྟོན་པའི་ཕྱིར་ཐབས་ཀྱི་སྟོབས་ཏེ།
en: They are the strength of patience in terms of accepting the misdeeds of all beings, the strength of wisdom in terms of cutting through the doubts of all beings, the strength of the higher knowledges in terms of how it knows the minds and deeds of all beings, and the strength of means in terms of how it teaches the Dharma as suited to individuals.

source: བཞི་པོ་དེ་དག་ནི་སྟོབས་ཡིན་ནོ།
en: These are its four strengths.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་གཏེར་ཆེན་པོ་མི་ཟད་པ་ཡིན་ཏེ།
en: “Nāga Lord, the inexhaustible casket dhāraṇī is an inexhaustible treasure in four respects.

source: དཀོན་མཆོག་གསུམ་གྱི་གདུང་མི་འཆད་པའི་གཏེར་ཆེན་པོ་མི་ཟད་པ་དང་། ཆོས་རྟོགས་པ་ཚད་མེད་པའི་གཏེར་ཆེན་པོ་མི་ཟད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་མགུ་བར་བྱ་བའི་གཏེར་ཆེན་པོ་མི་ཟད་པ་དང་། ནམ་མཁའ་དང་མཉམ་པའི་ཡེ་ཤེས་ཀྱི་གཏེར་ཆེན་པོ་མི་ཟད་པ་སྟེ།
en: It is an inexhaustible trove of the unbroken lineage of the Three Jewels, it is an inexhaustible trove of immeasurable Dharma realization, it is an inexhaustible trove of that which pleases all beings, and it is an inexhaustible trove of wisdom equal to space.

source: བཞི་པོ་དེ་དག་ནི། གཏེར་ཆེན་པོ་མི་ཟད་པ་ཡིན་ནོ།
en: In these four respects it is an inexhaustible treasure.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་ཚད་མེད་པ་ཉིད་དེ།
en: “Nāga Lord, there are four ways in which the inexhaustible casket dhāraṇī is immeasurable.

source: ཐོས་པ་ཚད་མེད་པ་ཉིད་དང་། ཤེས་རབ་ཚད་མེད་པ་ཉིད་དང་། ཡོངས་སུ་བསྔོ་བ་ཚད་མེད་པ་ཉིད་དང་། ངེས་པའི་ཚིག་བསྟན་པ་རྣམས་ལ་སྒྲ་ཚད་མེད་པ་ཉིད་དེ་བཞི་པོ་དེ་དག་གོ།
en: It consists in immeasurable learning, immeasurable insight, immeasurable dedication, and immeasurable utterances for teachings on etymology.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་དོན་ཡོད་པ་ཉིད་དེ།
en: “Nāga Lord, there are four ways in which the inexhaustible casket dhāraṇī is meaningful.

source: ཆོས་བསྟན་པ་དོན་ཡོད་པ་ཉིད་དང་། བདེན་པའི་ཚིག་བསྟན་པ་དོན་ཡོད་པ་ཉིད་དང་། ཆོས་ལ་སྦྱོར་བ་རྣམ་པར་དབྱེ་བ་དོན་ཡོད་པ་ཉིད་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དོན་ཡོད་པ་ཉིད་བཞི་པོ་དེ་དག་གོ།
en: It is meaningful Dharma teachings, it is meaningful teaching of the words of truth, it is meaningful in distinguishing the approaches to the Dharma, and it is meaningful in leading to the seat of awakening.

source: །ཀླུའི་བདག་པོ་བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ལ་མི་འཇིགས་པ་ཐོབ་པ་སྟེ།
en: “Nāga Lord, there are four ways in which one achieves fearlessness in the inexhaustible casket dhāraṇī.

source: ངན་འགྲོ་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་པ་ཐོབ་པ་དང་། འཁོར་རྣམས་ཀྱི་ནང་དུ་ཟིལ་གྱིས་གནོན་པས་མི་འཇིགས་པ་ཐོབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སོམ་ཉི་གཅོད་པ་ལ་མི་འཇིགས་པ་ཐོབ་པ་དང་། སངས་རྒྱས་ཀྱིས་ལ་འཇུག་པ་ལ་མི་འཇིགས་པ་ཐོབ་པ་སྟེ།
en: They are achieving fearlessness with regard to all lower realms, achieving fearlessness with regard to being bested within the assembly, achieving fearlessness in cutting through all beings’ doubts, and achieving fearlessness with regard to entering the stage of buddhahood.

source: བཞི་པོ་འདི་དག་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ལ་མི་འཇིགས་པ་ཐོབ་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ།
en: These four should be understood as the ways in which one achieves fearlessness in the inexhaustible casket dhāraṇī.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་ན་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ནི་ཡོན་ཏན་བསྟན་པ་ཚད་མེད་པ་དང་། ཤེས་རབ་ལ་འཇུག་པ་ཚད་མེད་པའོ།
en: “Nāga Lord, in this manner the descriptions of the qualities of the inexhaustible casket dhāraṇī are limitless, and its engagement with insight is limitless.

source: །ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་རྩེ་བ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྒྱ་ཆེར་རྩེ་བ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྣོད་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་རྣམས་དང་། སྡེ་སྣོད་དེ་ལ་འཇུག་པ་རྣམས་དང་། གཟུངས་ཀྱི་སྒོའི་ཕྱག་རྒྱ་ལ་འཇུག་པ་རྣམས་དང་། བསྒྲེ་བ་དང་། བསྒྲེ་བ་མ་ཡིན་པ་ལ་མཁས་པ་དང་། ལུས་དང་ངག་དང་སེམས་ཀྱི་རྒྱན་བཀོད་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡོངས་སུ་འཛིན་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་ཚོགས་བསགས་པ་རྣམས་དང་། སེམས་ཅན་ཡོངས་སུ་སྦྱངས་པའི་ཡེ་ཤེས་ལ་འཇུག་པ་རྣམས་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་། འཐུན་པ་དང་། སྟོབས་དང་། བརྩོན་འགྲུས་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཉེ་བར་བརྟན་པ་ཤེས་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་བཀོད་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཇི་སྙེད་པ་ཞེས་བྱ་བའི་ཚིག་ཏུ་སྨྲ་བ་ན་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཡང་དག་པར་སྨྲ་བས་སྨྲ་བར་བྱའོ། །ཀླུའི་བདག་པོ་སེམས་ཅན་གྱི་བརྡའི་རྗེས་སུ་འཇུག་པའམ།
en: “Nāga Lord, to genuinely express the inexhaustible casket dhāraṇī is to describe the entirety of the bodhisattvas’ conduct, the bodhisattvas’ wisdom, the bodhisattvas’ playfulness, the bodhisattvas’ vast play, the bodhisattvas’ ornamental array of qualities, the bodhisattvas’ paths, the bodhisattvas’ vessels, the bodhisattvas’ baskets and their knowledge of them, the bodhisattvas’ entries through the seal of the dhāraṇī door, their skill with regard to the fortunate and unfortunate, their ornamental arrangements of body and speech and mind, their mastery of the array of qualities of the buddha realms, their amassing the accumulations for the seat of awakening, their entry into the wisdom that purifies beings, their receiving the sublime Dharma, their firm knowledge of all concordance and strength and diligence and perfections, the array of the ornaments at the seat of awakening, and the qualities of buddhahood.

source: ཆོས་ཀྱི་བརྡའི་རྗེས་སུ་འཇུག་པའི་ཡི་གེ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་རྗེས་སུ་འཇུག་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔས་ཡི་གེ་དེ་དང་དེ་རྣམས་ཀྱི་ཚུལ་གྱི་དགོངས་པ་རབ་ཏུ་ཤེས་ཏེ།
en: “Nāga Lord, as for all the words that are applied to the terms for beings and phenomena, bodhisattvas know the intention behind each and every one of those syllables by way of applying the inexhaustible casket dhāraṇī.

source: འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་གཟོད་མ་ནས་དག་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ལ་སླུ་བར་མི་བྱེད་དོ།
en: That is, it does not deceive with regard to the nature of all phenomena, because the nature of all phenomena is originally pure.

source: །ཆོས་ཐམས་ཅད་དགའ་བས་ན་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བ་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the enjoyment of phenomena, because it enjoys all phenomena.

source: །ཆོས་ཐམས་ཅད་དོན་དམ་པ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ངེས་པའི་དོན་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the definitive meaning of phenomena, because all phenomena are ultimate.

source: །ཆོས་ཐམས་ཅད་མིག་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་སྣང་བ་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the appearance of all phenomena, because all phenomena are eyes.

source: །ཆོས་ཐམས་ཅད་མིང་ཙམ་དུ་ཟད་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་བརྡ་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the conventions of all phenomena, because all phenomena are simply names.

source: །ཆོས་ཐམས་ཅད་ཐོབ་པ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་དགོངས་པའི་སྦྱོར་བ་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the application of all phenomena, because all phenomena are attained.

source: །ཆོས་ཐམས་ཅད་དུལ་བས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཅང་ཤེས་ཉིད་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the nobility of all phenomena, because all phenomena are tamed.

source: །ཆོས་ཐམས་ཅད་ཞི་བས་ན་ཆོས་ཐམས་ཅད་ཀྱི་སྣང་བ་ཉིད་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the appearance of all phenomena, because all phenomena are quelled.

source: །ཆོས་ཐམས་ཅད་སྟོབས་དང་བྲལ་བས་ན་ཆོས་ཐམས་ཅད་ཀྱི་སྟོབས་མེད་པ་ཉིད་ལ་སླུ་བར་མི་བྱེད་དོ། །ཆོས་ཐམས་ཅད་ཚིག་མ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་མི་སྐྱེ་བ་ཉིད་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to any phenomenon lacking power, because all phenomena are devoid of power. It does not deceive with regard to phenomena being unborn, because no phenomena are verbalized.

source: །ཆོས་ཐམས་ཅད་དད་པ་དང་ལྡན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་མོས་པ་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the aspiration for all phenomena, because all phenomena possess faith.

source: །ཆོས་ཐམས་ཅད་ཚིག་གི་ལམ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་བརྗོད་པ་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the description of all phenomena, because all phenomena constitute the path of words.

source: །ཆོས་ཐམས་ཅད་དེ་བཞིན་ཉིད་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱི་རྗེས་སུ་འགྲོ་བ་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to that which accords with the thusness of all phenomena, because all phenomena are thusness.

source: །ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the sameness of all phenomena throughout the three times, because all phenomena are just as they are.

source: །ཆོས་ཐམས་ཅད་གནས་ན་གནས་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་མི་གཡོ་བ་ཉིད་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the lack of movement of all phenomena, because all phenomena abide in their places.

source: །ཆོས་ཐམས་ཅད་ལག་མཐིལ་ན་འདུག་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་བྱ་བ་ཡོད་པ་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to all phenomena having functions, because all phenomena lie in the palm of one’s hand.

source: །ཆོས་ཐམས་ཅད་མཉམ་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཁྱད་པར་མེད་པ་ཉིད་ལ་སླུ་བར་མི་བྱེད་དོ།
en: It does not deceive with regard to the sameness of all phenomena, because all phenomena are the same.

source: །ཆོས་ཐམས་ཅད་ལམ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཀུན་ནས་འཇུག་པ་སྟོན་ཏོ།
en: “Because all phenomena are path, they teach the entrance to all phenomena.

source: །ཆོས་ཐམས་ཅད་ནམ་མཁའ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ནམ་མཁའ་ལྟ་བུ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are space, they teach all phenomena to be like space.

source: །ཆོས་ཐམས་ཅད་ནན་གྱིས་བྱས་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་སྒྲོལ་བ་ཉིད་དུ་སྟོན་ཏོ།
en: Because all phenomena are produced with endurance, they teach all phenomena to be liberation itself.

source: །ཆོས་ཐམས་ཅད་བླང་དུ་མེད་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་བདག་པོ་མེད་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are ungraspable, they teach all phenomena to be ownerless.

source: །ཆོས་ཐམས་ཅད་དྲན་པ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་བརྗེད་པ་མེད་པ་སྟོན་ཏོ། །ཆོས་ཐམས་ཅད་གཟུངས་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་མི་ཟད་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are recollected, they teach all phenomena to be unforgettable. Because all phenomena are recalled, they teach the inexhaustibility of all phenomena.

source: །ཆོས་ཐམས་ཅད་ཞི་བ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཉེ་བར་ཞི་བ་སྟོན་ཏོ། །ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཉམ་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are peace, they teach the peacefulness of all phenomena. Because all phenomena are equal to space, they teach the genuine reality of all phenomena.

source: །ཆོས་ཐམས་ཅད་ཟད་པའི་སྒོ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཟད་པའི་མཐའི་སྒོ་སྟོན་ཏོ།
en: Because all phenomena are a gateway of exhaustion, they teach the gateway of the limit of exhaustion of all phenomena.

source: །ཆོས་ཐམས་ཅད་གནས་ན་གནས་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་གནས་པའི་ཆོས་ཉིད་སྟོན་ཏོ།
en: Because all phenomena abide in their places, they teach the abiding reality of all phenomena.

source: །ཆོས་ཐམས་ཅད་ཡེ་ཤེས་ལ་འཇུག་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་གཏི་མུག་དང་བྲལ་བ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are subsumed within wisdom, they teach the absence of delusion in all phenomena.

source: །ཆོས་ཐམས་ཅད་ཁོངས་སུ་འདུས་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་སྣྲེལ་ཞི་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are included, they teach the disorder of all phenomena.

source: །ཆོས་ཐམས་ཅད་དངོས་པོ་དང་བྲལ་བས་ན་ཆོས་ཐམས་ཅད་ཀྱི་དངོས་པོ་མེད་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are devoid of existence, they teach the nonexistence of all phenomena.

source: །ཆོས་ཐམས་ཅད་གཡོ་བ་དང་ལྡན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་བཞིན་མ་ཡིན་པ་ཡོངས་སུ་འཛིན་པ་སྟོན་ཏོ།
en: Because all phenomena fluctuate, they teach the way that all phenomena are inaccurately apprehended.

source: །ཆོས་ཐམས་ཅད་དྲན་པར་བྱེད་པ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་སྟོན་ཏོ།
en: “Because all phenomena are recollected, they teach the recollection of the past abodes of all phenomena.

source: །ཆོས་ཐམས་ཅད་ཡོ་བྱད་མང་བ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་སྲིད་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are plentiful resources, they teach the potential of all phenomena.

source: །ཆོས་ཐམས་ཅད་ཀྱིས་ཞེས་བྱ་བ་ལ་འཇུག་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་མ་ནིང་གི་ཚིག་བླ་དགས་སྟོན་ཏོ།
en: Because all phenomena are subsumed within the syllable sa , they teach the synonyms of the neuter words of all phenomena.

source: །ཆོས་ཐམས་ཅད་ཧ་ཞེས་བྱ་བ་དང་། ན་ཞེས་བྱ་བ་ལ་འཇུག་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་མི་འདྲ་བ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are subsumed within the syllables ha and na , they teach the dissimilarity of all phenomena.

source: །ཆོས་ཐམས་ཅད་རྒྱ་མཚོ་ལ་འཇུག་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་དགོངས་པའི་ཚིག་རྒྱ་ཆེན་པོ་སྟོན་ཏོ།
en: Because all phenomena are subsumed within the ocean, they teach the vast words of the intent of all phenomena.

source: །ཆོས་ཐམས་ཅད་ལྷུན་སྟུག་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་བསྐྱོད་དུ་མེད་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are massive and imposing, they teach the unshakable nature of all phenomena.

source: །ཆོས་ཐམས་ཅད་གནས་ན་གནས་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་དབྱིངས་གནས་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena abide in their own place, they teach the fact that all phenomena abide in the realm of phenomena.

source: །ཆོས་ཐམས་ཅད་འདྲེན་པ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པའི་འདུལ་བ་སྟོན་ཏོ།
en: Because all phenomena are guides, they teach the genuine gentleness of all phenomena.

source: །ཆོས་ཐམས་ཅད་འབྲས་བུ་ཐོབ་པ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཡིད་ལ་བྱེད་པ་མེད་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are the attainment of a result, they teach the absence of mental activity in all phenomena.

source: །ཆོས་ཐམས་ཅད་ཕུང་པོ་ཙམ་དུ་ཟད་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པ་སྟོན་ཏོ།
en: Because all phenomena are simply aggregations, they teach the full knowledge of the suffering related to all phenomena.

source: །ཆོས་ཐམས་ཅད་ཆོམ་རྐུན་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་གློ་བུར་གྱི་ཉེ་བའི་ཉོན་མོངས་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are bandits, they teach the provisionally afflictive nature of all phenomena.

source: །ཆོས་ཐམས་ཅད་སྤངས་པ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་མངོན་པར་ཞེན་པ་མེད་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena have been relinquished, they teach the lack of clinging related to all phenomena.

source: །ཆོས་ཐམས་ཅད་ད་ཞེས་བྱ་བ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ལམ་ཆད་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are the syllable da , they teach the discontinuous path of all phenomena.

source: །ཆོས་ཐམས་ཅད་དྷ་ཞེས་བྱ་བ་ཡིན་པས་ན་ཆོས་ཐམས་ཅད་ཀྱི་མཐའ་ཡས་པ་དང་ཡོངས་སུ་ཆད་པ་མེད་པ་ཉིད་སྟོན་ཏོ།
en: Because all phenomena are the syllable dha , they teach the infinite and undisrupted nature of all phenomena.

source: །ཀླུའི་བདག་པོ་འདི་ནི་ཡི་གེའི་བརྡ་ལ་འཇུག་པ་ཞེས་བྱ་བ་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ལ་བྱང་ཆུབ་སེམས་དཔས་གཟུངས་ཐོབ་ནས་ཡི་གེ་ཐམས་ཅད་ཀྱི་ངེས་པའི་ཚིག་གི་དགོངས་པ་རྟོག་པར་འགྱུར་བའོ།
en: “Nāga Lord, once bodhisattvas acquire retention with respect to this inexhaustible casket dhāraṇī called that which applies to linguistic designations , they will understand the intention behind the etymologies of all words.

source: །ཀླུའི་བདག་པོ་དཔེར་ན་ཡི་གེ་རྣམས་མི་ཟད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱི་བསྟན་པ་མི་ཟད་དོ།
en: Nāga Lord, just as words are inexhaustible, so too are the teachings on all phenomena.

source: །དཔེར་ན་ཡི་གེ་རྣམས་ནི་ལུས་སམ་སེམས་གང་ནས་ཀྱང་མི་འབྱུང་བ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་གང་ནས་ཀྱང་མི་འབྱུང་སྟེ།
en: By way of analogy, just as words do not arise at all from either body or mind, so too do no phenomena arise from anything.

source: ལུས་ལ་ཡང་མི་གནས་སེམས་ལ་ཡང་མི་གནས་སོ།
en: They do not abide in body, nor do they abide in mind.

source: །དཔེར་ན་ཡི་གེ་རྣམས་ནི་ཀུན་ནས་ཉོན་མོངས་པར་ཡང་མི་འགྱུར་ལ་ཀུན་ནས་ཉོན་མོངས་པར་ཡང་བརྗོད་དོ།
en: Words do not become polluted, yet they describe the polluted state.

source: །རྣམ་པར་བྱང་བར་ཡང་མི་འགྱུར་ལ་རྣམ་པར་བྱང་བ་ཡང་བརྗོད་དོ་དེ་བཞིན་དུ་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་བརྗོད་ལ་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་ཀྱིས་ཀྱང་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར་རོ།
en: They do not become purified, yet they describe the purified state. Likewise, bodhisattvas who have attained the inexhaustible casket dhāraṇī describe pollution yet cannot become polluted by any polluting phenomena.

source: །རྣམ་པར་བྱང་བའི་ཆོས་ཀྱང་བརྗོད་ལ་རྣམ་པར་བྱང་བའི་ཆོས་ཀྱིས་ཀྱང་རྣམ་པར་དག་པར་མི་འགྱུར་ཏེ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: Though they describe purified phenomena, they cannot become purified by purified phenomena, because they are already utterly pure.

source: །དཔེར་ན་ཡི་གེ་རྣམས་ནི་གང་ནས་ཀྱང་མ་འཕོས་ལ་གོ་བར་ཡང་བྱེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་གང་ནས་ཀྱང་མ་འཕོས་ལ་གོ་བར་ཡང་བྱེད་དེ།
en: “As an analogy, words can communicate without being transferred from anywhere.

source: གཞན་གྱི་སེམས་ཀྱང་རྣམ་པར་དག་པར་བྱེད་དོ།
en: Likewise, all phenomena can bring about understanding and even purify the minds of others without being transferred from anywhere.

source: །དཔེར་ན་ཡི་གེ་བརྗོད་པ་རྣམས་ཀྱང་ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་འགྲོ་བ་མེད་ལ་མ་བརྗོད་པ་རྣམས་ཀྱང་ནང་དུ་སོགས་པ་མེད་པ་དེ་བཞིན་དུ་ཆོས་བརྗོད་པའམ།
en: “As an analogy, spoken words do not travel throughout the cardinal and intermediate directions, and unspoken words do not accumulate internally.

source: བསྟན་པ་ཐམས་ཅད་ཀྱང་ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་འགྲོ་བ་མེད་ལ་མ་བསྟན་པ་རྣམས་ཀྱང་ནང་དུ་སོགས་པ་མེད་དོ།
en: Likewise, all the teachings of the Dharma do not travel throughout the cardinal and intermediate directions, and what is not taught does not accumulate internally.
